Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.39/edc/PIC32MZ2048EFG144.PIC
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="hi" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="hi" edc:nmmrflags="St" edc:nmmrid="1156" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDUhigh" edc:desc="" edc:mask="0xffffffff" edc:name="MDUhigh" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="lo1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="lo1" edc:nmmrflags="St" edc:nmmrid="1160" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDUlow" edc:desc="" edc:mask="0xffffffff" edc:name="MDUlow" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="hi1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="hi1" edc:nmmrflags="St" edc:nmmrid="1164" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDUhigh" edc:desc="" edc:mask="0xffffffff" edc:name="MDUhigh" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="lo2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="lo2" edc:nmmrflags="St" edc:nmmrid="1168" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDUlow" edc:desc="" edc:mask="0xffffffff" edc:name="MDUlow" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="hi2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="hi2" edc:nmmrflags="St" edc:nmmrid="1172" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDUhigh" edc:desc="" edc:mask="0xffffffff" edc:name="MDUhigh" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="lo3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="lo3" edc:nmmrflags="St" edc:nmmrid="1176" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDUlow" edc:desc="" edc:mask="0xffffffff" edc:name="MDUlow" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="hi3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="hi3" edc:nmmrflags="St" edc:nmmrid="1180" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDUhigh" edc:desc="" edc:mask="0xffffffff" edc:name="MDUhigh" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="----nnnnnnnnnnnn-nnnnnnnn-nnnnnn" edc:cname="DSPControl" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DSPControl" edc:nmmrflags="St" edc:nmmrid="1184" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="POS" edc:desc="" edc:mask="0x3f" edc:name="POS" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SCOUNT" edc:desc="" edc:mask="0x3f" edc:name="SCOUNT" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="C" edc:desc="" edc:mask="0x1" edc:name="C" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EFI" edc:desc="" edc:mask="0x1" edc:name="EFI" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="OUTFLAG" edc:desc="" edc:mask="0xff" edc:name="OUTFLAG" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="CCOND" edc:desc="" edc:mask="0xf" edc:name="CCOND" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="f0" edc:desc="" edc:impl="0xffffffffffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000000000000000000000000000000000000000000000000" edc:name="f0" edc:nmmrflags="St" edc:nmmrid="1280" edc:nzwidth="0x40" edc:por="0000000000000000000000000000000000000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="f0" edc:desc="" edc:mask="0xffffffffffffffff" edc:name="f0" edc:nzwidth="0x40"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="f1" edc:desc="" edc:impl="0xffffffffffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000000000000000000000000000000000000000000000000" edc:name="f1" edc:nmmrflags="St" edc:nmmrid="1288" edc:nzwidth="0x40" edc:por="0000000000000000000000000000000000000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="f1" edc:desc="" edc:mask="0xffffffffffffffff" edc:name="f1" edc:nzwidth="0x40"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="f2" edc:desc="" edc:impl="0xffffffffffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000000000000000000000000000000000000000000000000" edc:name="f2" edc:nmmrflags="St" edc:nmmrid="1296" edc:nzwidth="0x40" edc:por="0000000000000000000000000000000000000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="f2" edc:desc="" edc:mask="0xffffffffffffffff" edc:name="f2" edc:nzwidth="0x40"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x2c4" edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="f3" edc:desc="" edc:impl="0xffffffffffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000000000000000000000000000000000000000000000000" edc:name="f3" edc:nmmrflags="St" edc:nmmrid="1304" edc:nzwidth="0x40" edc:por="0000000000000000000000000000000000000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="f3" edc:desc="" edc:mask="0xffffffffffffffff" edc:name="f3" edc:nzwidth="0x40"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
